; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-94)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c3)
    (capacity v2 c2)
    (capacity v3 c3)
    (capacity v4 c3)
    (capacity v5 c3)
    (capacity v6 c2)
    (capacity v7 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l10)
    (at p2 l4)
    (at p3 l15)
    (at p4 l10)
    (at p5 l1)
    (at p6 l5)
    (at p7 l12)
    (at p8 l9)
    (at p9 l12)
    (at p10 l12)
    (at p11 l10)
    (at p12 l9)
    (at p13 l9)
    (at p14 l9)
    (at p15 l9)
    (at p16 l2)
    (at v1 l7)
    (at v2 l10)
    (at v3 l1)
    (at v4 l9)
    (at v5 l3)
    (at v6 l10)
    (at v7 l9)
    (road l6 l15)
    (road l3 l7)
    (road l3 l16)
    (road l8 l9)
    (road l9 l8)
    (road l9 l11)
    (road l8 l15)
    (road l1 l9)
    (road l2 l14)
    (road l15 l5)
    (road l15 l8)
    (road l15 l14)
    (road l14 l12)
    (road l9 l1)
    (road l14 l15)
    (road l5 l15)
    (road l9 l13)
    (road l10 l8)
    (road l16 l3)
    (road l15 l7)
    (road l7 l3)
    (road l7 l15)
    (road l14 l2)
    (road l4 l1)
    (road l12 l14)
    (road l8 l10)
    (road l11 l9)
    (road l1 l4)
    (road l13 l9)
    (road l15 l6)
    (road l10 l15)
    (road l15 l10)
    (road l1 l6)
    (road l6 l1)
    (road l1 l2)
    (road l2 l1)
    (road l6 l12)
    (road l12 l6)
    (road l7 l8)
    (road l8 l7)
    (road l4 l9)
    (road l9 l4)
    (road l13 l15)
    (road l15 l13)
    (road l1 l16)
    (road l16 l1)
    (road l9 l14)
    (road l14 l9)
    (road l11 l13)
    (road l13 l11)
    )
 (:goal (and 
(at p1 l6)
(at p2 l11)
(at p3 l8)
(at p4 l3)
(at p5 l5)
(at p6 l16)
))
)

; plan
1. (pick-up v3 l1 p5 c2 c3)
   deleted: (at p5 l1) (capacity v3 c3)
   added: (in p5 v3) (capacity v3 c2)
   goals met: 0 of 6
2. (drive v3 l1 l6)
   deleted: (at v3 l1)
   added: (at v3 l6)
   goals met: 0 of 6
3. (drive v3 l6 l15)
   deleted: (at v3 l6)
   added: (at v3 l15)
   goals met: 0 of 6
4. (pick-up v3 l15 p3 c1 c2)
   deleted: (at p3 l15) (capacity v3 c2)
   added: (in p3 v3) (capacity v3 c1)
   goals met: 0 of 6
5. (drive v3 l15 l5)
   deleted: (at v3 l15)
   added: (at v3 l5)
   goals met: 0 of 6
6. (drop v3 l5 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l5) (capacity v3 c2)
   goals met: 1 of 6
7. (pick-up v3 l5 p6 c1 c2)
   deleted: (at p6 l5) (capacity v3 c2)
   added: (in p6 v3) (capacity v3 c1)
   goals met: 1 of 6
8. (drive v3 l5 l15)
   deleted: (at v3 l5)
   added: (at v3 l15)
   goals met: 1 of 6
9. (drive v3 l15 l10)
   deleted: (at v3 l15)
   added: (at v3 l10)
   goals met: 1 of 6
10. (pick-up v3 l10 p4 c0 c1)
   deleted: (at p4 l10) (capacity v3 c1)
   added: (in p4 v3) (capacity v3 c0)
   goals met: 1 of 6
11. (drive v3 l10 l8)
   deleted: (at v3 l10)
   added: (at v3 l8)
   goals met: 1 of 6
12. (drop v3 l8 p3 c0 c1)
   deleted: (in p3 v3) (capacity v3 c0)
   added: (at p3 l8) (capacity v3 c1)
   goals met: 2 of 6
13. (pick-up v6 l10 p1 c1 c2)
   deleted: (at p1 l10) (capacity v6 c2)
   added: (in p1 v6) (capacity v6 c1)
   goals met: 2 of 6
14. (drive v3 l8 l7)
   deleted: (at v3 l8)
   added: (at v3 l7)
   goals met: 2 of 6
15. (drive v3 l7 l3)
   deleted: (at v3 l7)
   added: (at v3 l3)
   goals met: 2 of 6
16. (drop v3 l3 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l3) (capacity v3 c2)
   goals met: 3 of 6
17. (drive v3 l3 l16)
   deleted: (at v3 l3)
   added: (at v3 l16)
   goals met: 3 of 6
18. (drop v3 l16 p6 c2 c3)
   deleted: (in p6 v3) (capacity v3 c2)
   added: (at p6 l16) (capacity v3 c3)
   goals met: 4 of 6
19. (drive v7 l9 l4)
   deleted: (at v7 l9)
   added: (at v7 l4)
   goals met: 4 of 6
20. (pick-up v7 l4 p2 c1 c2)
   deleted: (at p2 l4) (capacity v7 c2)
   added: (in p2 v7) (capacity v7 c1)
   goals met: 4 of 6
21. (drive v7 l4 l9)
   deleted: (at v7 l4)
   added: (at v7 l9)
   goals met: 4 of 6
22. (drive v7 l9 l11)
   deleted: (at v7 l9)
   added: (at v7 l11)
   goals met: 4 of 6
23. (drop v7 l11 p2 c1 c2)
   deleted: (in p2 v7) (capacity v7 c1)
   added: (at p2 l11) (capacity v7 c2)
   goals met: 5 of 6
24. (drive v6 l10 l15)
   deleted: (at v6 l10)
   added: (at v6 l15)
   goals met: 5 of 6
25. (drive v6 l15 l6)
   deleted: (at v6 l15)
   added: (at v6 l6)
   goals met: 5 of 6
26. (drop v6 l6 p1 c1 c2)
   deleted: (in p1 v6) (capacity v6 c1)
   added: (at p1 l6) (capacity v6 c2)
   goals met: 6 of 6
